Tekla.Structures.ModelInternal.Operation.dotSaveModel


Tekla.Structures.ModelInternal.Operation.dotSaveAsModel(System.String)


Tekla.Structures.ModelInternal.Operation.dotAutoSaveModel


Tekla.Structures.ModelInternal.Operation.dotQuitProgram


Tekla.Structures.ModelInternal.Operation.dotCreateEmptyModel(System.String,System.String,System.Boolean)


Tekla.Structures.ModelInternal.Operation.dotSharingWriteOutCommit(System.Boolean,System.String,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@)
The dot sharing write out commit.
success: True if write out was successful so commit to be done, if false uncommit to be done.
packetFolder: Full path to the folder that contains all the files that will be included in the write out file.
moduleBaselines: The module baselines, tuples of old baseline and new baseline.
Returns: Commit/uncommit result.

Tekla.Structures.ModelInternal.Operation.dotSharingReadIn(System.String,Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum@,System.String@,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@)


Tekla.Structures.ModelInternal.Operation.dotRefreshReferenceModel(Tekla.Structures.Model.ReferenceModel,System.Guid,System.String,System.Collections.ArrayList)
DO NOT USE! For internal usage only!
Model: Reference Model to refresh, mandatory
FullFileDataSet: DataSet GUID for full file
FullFile: FullFile name
DiffFiles: Sorted DiffFile names if any
Returns: